package day0108;

public class WhileFor_05 {

	public static void main(String[] args) {
		// 반복문
		/*
		 * 1.  while(조건식)
		 * {
		 *     수행문장
		 * }
		 * ==>조건이 참일동안 반복실행..조건식이 처음부터 안맞으면 한번도 실행 안함(선조건)
		 * 
		 * 2. do{
		 *   수행문장
		 * }while(조건식);
		 * 
		 * ==>조건이 참일동안 반복실행..조건식이 처음부터 안맞더라도 한번은 실행함(후조건)
		 * 
		 * 
		 * 3.for(초기값; 조건식; 증감식)
		 * {
		 *     수행문장
		 * }
		 * 
		 * ==>반복회수가 정해져있는 경우에 많이 사용(예: 배열)
		 * 초기값 실행후 조건에 맞으면 문장수해
		 * 그리고 증감=> 다시 조건비교=>수행
		 * 
		 * 조건에 안맞으면 빠져나감
		 * 
		 * 
		 * 4.break
		 *   현재속한 반복문을 빠져나간다
		 *   
		 *   break lable:
		 *   lable이 선언된 반복문 빠져나갈수 있다(2개이상의 반복문을 빠져나가고자 할때 사용)
		 * 
		 * 4:continue
		 * : 반복문에서 continue 를 만나면 남은코드를 실행하지 않고 
		 *   증감식으로 이동한후 다시 조건비교하여 수행한다
		 */

	}

}
